const SecondMethod = ({ matrix, answers }: any) => {
  // 0. Тэгээс ялгаатай гол элемент сонгох. Хэрэв 0 байвал тухайн мөрийн дараагийн баганын утгыг шалгах
  // 1. Гол элемент −𝑎𝑟𝑠 –ийг урвуу хэмжигдэхүүн нь солино.
  // 2. Ялгагч мөрийн бусад элементийг гол элементэд хуваана.
  // 3. Ялгагч баганын бусад элементийг гол элементэд хувааж тэмдэгийг нь эсрэгээр өөрчилнө.
  // 4. Ялгагч мөр баганын бус бусад элементүүд дараах томьёогоор хувирна. 𝑏ij=(𝑎𝑖𝑗*𝑎𝑟𝑠−𝑎𝑖𝑠*𝑎𝑟𝑗)/(−𝑎𝑟𝑠)

  return (
    <div>
      {/* moriin toogoor huvirgalt hiigeed araas n sul elementee avah ym baina. tgd huvirgaltuudaaraa naagaal */}
    </div>
  );
};

export default SecondMethod;
